In [1]:
import pandas as pd
import numpy as np

In [45]:
df = pd.read_csv("used_cars_data.csv")
df.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [3]:
df["Location"].unique()

array(['Mumbai', 'Pune', 'Chennai', 'Coimbatore', 'Hyderabad', 'Jaipur',
       'Kochi', 'Kolkata', 'Delhi', 'Bangalore', 'Ahmedabad'],
      dtype=object)

In [4]:
df['Fuel_Type'].unique()

array(['CNG', 'Diesel', 'Petrol', 'LPG', 'Electric'], dtype=object)

In [5]:
df['Transmission'].unique()

array(['Manual', 'Automatic'], dtype=object)

In [8]:
df['Owner_Type'].unique()

array(['First', 'Second', 'Fourth & Above', 'Third'], dtype=object)

In [46]:
df = df.loc[:,['Location','Fuel_Type','Transmission','Kilometers_Driven','Owner_Type','Price']]

In [47]:
df.head()

     Location Fuel_Type Transmission  Kilometers_Driven Owner_Type  Price
0      Mumbai       CNG       Manual              72000      First   1.75
1        Pune    Diesel       Manual              41000      First  12.50
2     Chennai    Petrol       Manual              46000      First   4.50
3     Chennai    Diesel       Manual              87000      First   6.00
4  Coimbatore    Diesel    Automatic              40670     Second  17.74

In [125]:
pd.get_dummies(df,columns=['Fuel_Type','Transmission','Owner_Type'],drop_first=True,dtype=np.int64)

,Location,Kilometers_Driven,Price,Fuel_Type_Diesel,Fuel_Type_Electric,Fuel_Type_LPG,Fuel_Type_Petrol,Transmission_Manual,Owner_Type_Fourth & Above,Owner_Type_Second,Owner_Type_Third
0,Mumbai,72000,1.75,0,0,0,0,1,0,0,0
1,Pune,41000,12.50,1,0,0,0,1,0,0,0
2,Chennai,46000,4.50,0,0,0,1,1,0,0,0
3,Chennai,87000,6.00,1,0,0,0,1,0,0,0
4,Coimbatore,40670,17.74,1,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...
7248,Hyderabad,89411,NaN,1,0,0,0,1,0,0,0
7249,Mumbai,59000,NaN,0,0,0,1,0,0,0,0
7250,Kolkata,28000,NaN,1,0,0,0,1,0,0,0
7251,Pune,52262,NaN,0,0,0,1,0,0,0,1
7252,Kochi,72443,NaN,1,0,0,0,0,0,0,0

In [20]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split

In [98]:
df.shape

(7253, 6)

In [108]:
ohe = OneHotEncoder(drop='first',dtype = np.int32,categories='auto')

In [109]:
x_train,x_test,y_train,y_test = train_test_split(df[['Location','Fuel_Type','Transmission','Owner_Type','Kilometers_Driven']],df.iloc[:,-1], test_size=0.2)

In [52]:
x_train.head()

       Location Fuel_Type Transmission Owner_Type  Kilometers_Driven
5719      Kochi    Petrol       Manual      First              47234
6155       Pune    Diesel    Automatic      First              24001
5054  Ahmedabad    Diesel       Manual      First              42150
1565    Chennai    Diesel    Automatic     Second              95000
7124  Hyderabad    Diesel    Automatic      First              78265

In [110]:
x_train_new = ohe.fit_transform(x_train[['Fuel_Type','Transmission','Owner_Type']]).toarray()
x_train_new

array([[1, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       ...,
       [1, 0, 0, ..., 0, 1, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0]], shape=(5802, 8), dtype=int32)

In [111]:
x_train_new = np.hstack((x_train[['Location','Kilometers_Driven']].values,x_train_new))
x_train_new

array([['Coimbatore', 26927, 1, ..., 0, 0, 0],
       ['Delhi', 25000, 0, ..., 0, 0, 0],
       ['Kochi', 14076, 1, ..., 0, 0, 0],
       ...,
       ['Hyderabad', 40000, 1, ..., 0, 1, 0],
       ['Coimbatore', 60083, 1, ..., 0, 0, 0],
       ['Kochi', 55980, 1, ..., 0, 0, 0]], shape=(5802, 10), dtype=object)

In [113]:
df2 = pd.DataFrame(x_train_new)

In [115]:
df2.sample(2)

              0       1  2  3  4  5  6  7  8  9
4579  Bangalore   70359  1  0  0  0  1  0  0  0
3904    Chennai  135000  1  0  0  0  1  0  1  0

In [117]:
counts = df['Location'].value_counts()

In [121]:
threshold = 500
repl = counts[counts <= threshold].index
repl

Index(['Jaipur', 'Bangalore', 'Ahmedabad'], dtype='object', name='Location')

In [126]:
df3 = pd.get_dummies(df['Location'].replace(repl,'others'),dtype=np.int32)
df3.sample(10)

,Chennai,Coimbatore,Delhi,Hyderabad,Kochi,Kolkata,Mumbai,Pune,others
1424,0,0,0,0,0,0,1,0,0
911,0,0,0,0,1,0,0,0,0
4824,0,0,0,0,0,0,0,1,0
2765,0,0,0,0,0,0,0,0,1
27,0,0,0,1,0,0,0,0,0
1146,0,0,0,0,0,0,1,0,0
2150,0,1,0,0,0,0,0,0,0
5835,0,0,0,1,0,0,0,0,0
2131,0,0,0,0,0,0,1,0,0
609,0,0,0,0,0,0,0,0,1